//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Константы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAccountDbConstants.cs
*		Константы для базы данных аккаунта пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountConstants
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Константы для базы данных аккаунта пользователя
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XDbConstants
        {
            /// <summary>
            /// Имя схемы модуля аккаунта для базы данных
            /// </summary>
            public const String SchemeName = "adm";

            /// <summary>
            /// Имя таблицы для хранения истории миграции
            /// </summary>
            public const String MigrationHistoryTableName = "__EFIdentityMigrationHistory";

            /// <summary>
            /// Имя строки подключения в файле конфигурации
            /// </summary>
            public const String ConnectingUserDb = "UserDb";
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================