//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с разрешениями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserPermissionConstants.cs
*		Работа с константными и первоначальными данными подсистемы работы с разрешениями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountPermission
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения констант и первоначальных данных подсистемы работы с разрешениями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XUserPermissionConstants
        {
            /// <summary>
            /// Базовое разрешение для полного доступа в систему
            /// </summary>
            public static readonly UserPermission Admin = new UserPermission()
            {
                Id = 1,
				Name = "admin",
				DisplayName = "Администратор",
			};

            /// <summary>
            /// Базовое разрешение для модератора/редактора
            /// </summary>
            public static readonly UserPermission Editor = new UserPermission()
            {
                Id = 2,
				Name = "editor",
                DisplayName = "Модератор",
            };

            /// <summary>
            /// Базовое разрешение для пользователя
            /// </summary>
            public static readonly UserPermission User = new UserPermission()
            {
                Id = 3,
				Name = "user",
                DisplayName = "Пользователь",
            };
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================