//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с разрешениями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserPermissionErrors.cs
*		Работа с ошибками подсистемы работы с разрешениями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountPermission
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения ошибок подсистемы работы с разрешениями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XUserPermissionErrors
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Разрешение не найдено
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 2000,
                Message = "Разрешение не найдено",
                Succeeded = false,
            };

            /// <summary>
            /// Нельзя удалить константное разрешение
            /// </summary>
            public static readonly Result NotDeleteConst = new()
            {
                Code = 2001,
                Message = "Нельзя удалить константное разрешение",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================