//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с разрешениями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusPermissionConstants.cs
*		Работа с константными и первоначальными данными подсистемы работы с разрешениями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountPermission
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения констант и первоначальных данных подсистемы работы с разрешениями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XPermissionConstants
        {
            /// <summary>
            /// Базовое разрешение для полного доступа в систему
            /// </summary>
            public static readonly CPermission Admin = new CPermission()
            {
                Id = 1,
                DispalyName = "Администрирование системы",
                SystemName = "admin",
            };

            /// <summary>
            /// Базовое разрешение для модератора/редактора
            /// </summary>
            public static readonly CPermission Editor = new CPermission()
            {
                Id = 2,
                DispalyName = "Модератор",
                SystemName = "editor",
            };

            /// <summary>
            /// Базовое разрешение для пользователя
            /// </summary>
            public static readonly CPermission User = new CPermission()
            {
                Id = 3,
                DispalyName = "Пользователь",
                SystemName = "user",
            };
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================