//=====================================================================================================================
// Проект: Модуль WebApi учетной записи пользователя
// Раздел: Константы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRoutesConstants.cs
*		Константы для определения путей.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /**
         * \defgroup AccountWebApiConstants Константы
         * \ingroup AccountWebApi
         * \brief Константы модуля.
         * @{
         */
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Константы для определения путей
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XRoutesConstants
        {
            /// <summary>
            /// Адрес сервера авторизации и валидации
            /// </summary>
            public const String ServerUri = "ServerUri";

            /// <summary>
            /// Конечная точка для получения токена
            /// </summary>
            public const String TokenEndpoint = "/connect/token";

            /// <summary>
            /// Конечная точка для получение информации пользвателе
            /// </summary>
            public const String UserInfoEndpoint = "/connect/userinfo";

			/// <summary>
			/// Конечная точка для выхода пользователя
			/// </summary>
			public const String LogoutEndpoint = "/connect/logout";

			/// <summary>
			/// Конечная точка для регистрации пользователя
			/// </summary>
			public const String RegisterEndpoint = "api/Authorize/Register";

        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================