export const position = {
  id: 'ИД',
  idDesc: 'Идентификатор должности',
  name: 'Наименование',
  nameDesc: 'Полное наименование должности',
  shortName: 'Краткое наименование',
  shortNameDesc: 'Краткое наименование должности',
  edit: 'Редактировать',
  editDesc: 'Редактировать должность',
  save: 'Сохранить',
  saveDesc: 'Сохранить должность',
  duplicate: 'Дублировать',
  duplicateDesc: 'Дублировать должность',
  delete: 'Удалить',
  deleteDesc: 'Удалить должность',
  cancel: 'Отменить',
  cancelDesc: 'Отменить изменения должности'
};
