//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с должностями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserPositionConstants.cs
*		Работа с константными и первоначальными данными подсистемы работы с должностями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountPosition
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения констант и первоначальных данных подсистемы работы с должностями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XUserPositionConstants
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Инспектор
            /// </summary>
            public static readonly UserPosition Inspector = new UserPosition()
            {
                Id = 1,
                Name = "Инспектор",
                ShortName = "Инспектор",
            };

            /// <summary>
            /// Старший инспектор
            /// </summary>
            public static readonly UserPosition ChiefInspector = new UserPosition()
            {
                Id = 2,
                Name = "Старший инспектор",
                ShortName = "Старший инспектор",
            };

            /// <summary>
            /// Ведущий специалист
            /// </summary>
            public static readonly UserPosition LeadingSpecialist = new UserPosition()
            {
                Id = 3,
                Name = "Ведущий специалист",
                ShortName = "Ведущий специалист",
            };

            /// <summary>
            /// Начальник отдела
            /// </summary>
            public static readonly UserPosition DepartmentHead = new UserPosition()
            {
                Id = 4,
                Name = "Начальник отдела",
                ShortName = "Начальник отдела",
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================