//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAccountDevice.cs
*		Класс для определения устройство пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountEntities
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс для определения устройство пользователя
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class CDevice : EntityDb<Int32>
        {
            #region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
            /// <summary>
            /// Неизвестный параметр устройства
            /// </summary>
            public const string Unknow = "Unknow";

            /// <summary>
            /// Имя таблицы
            /// </summary>
            public const String TABLE_NAME = "Device";
            #endregion

            #region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Конфигурирование модели для типа <see cref="CDevice"/>
            /// </summary>
            /// <param name="modelBuilder">Интерфейс для построения моделей</param>
            //---------------------------------------------------------------------------------------------------------
            public static void ModelCreating(ModelBuilder modelBuilder)
            {
                // Определение для таблицы
                var model = modelBuilder.Entity<CDevice>();
                model.ToTable(TABLE_NAME, XDbConstants.SchemeName);
            }
            #endregion

            #region ======================================= СВОЙСТВА ==================================================
            /// <summary>
            /// Тип устройства
            /// </summary>
            [MaxLength(40)]
            public String? Family { get; set; }

            /// <summary>
            /// Бренд устройства
            /// </summary>
            [MaxLength(20)]
            public String? Brand { get; set; }

            /// <summary>
            /// Модель устройства
            /// </summary>
            [MaxLength(20)]
            public String? Model { get; set; }

            /// <summary>
            /// Код устройства
            /// </summary>
            [MaxLength(60)]
            public String CodeId { get; private set; } = null!;

            /// <summary>
            /// Статус мобильного устройства
            /// </summary>
            public Boolean IsMobileDevice { get; set; }

            /// <summary>
            /// Наименование операционной системы
            /// </summary>
            public String? Platform { get; set; }

            /// <summary>
            /// Все сессии
            /// </summary>
            public ICollection<CSession> Sessions { get; set; } = new HashSet<CSession>();
            #endregion

            #region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Установка кода устройства
            /// </summary>
            //---------------------------------------------------------------------------------------------------------
            public void SetCodeId()
            {
                CodeId = $"{Family ?? Unknow}-{Brand ?? Unknow}-{Model ?? Unknow}";
            }
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================