//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAccountFieldActivity.cs
*		Класс для определения сферы деятельности пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountEntities
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс для определения сферы деятельности пользователя
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class CFieldActivity : EntityDb<Int32>
        {
            #region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
            /// <summary>
            /// Имя таблицы
            /// </summary>
            public const String TABLE_NAME = "FieldActivity";
            #endregion

            #region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Конфигурирование модели для типа <see cref="CFieldActivity"/>
            /// </summary>
            /// <param name="modelBuilder">Интерфейс для построения моделей</param>
            //---------------------------------------------------------------------------------------------------------
            public static void ModelCreating(ModelBuilder modelBuilder)
            {
                // Определение для таблицы
                var model = modelBuilder.Entity<CFieldActivity>();
                model.ToTable(TABLE_NAME, XDbConstants.SchemeName);
            }
            #endregion

            #region ======================================= СВОЙСТВА ==================================================
            /// <summary>
            /// Наименование сферы деятельности
            /// </summary>
            [MaxLength(40)]
            public String Name { get; set; } = String.Empty;

            /// <summary>
            /// Краткое наименование сферы деятельности
            /// </summary>
            [MaxLength(20)]
            public String? ShortName { get; set; }

            /// <summary>
            /// Все пользователи
            /// </summary>
            public ICollection<CUser> Users { get; set; } = new HashSet<CUser>();
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================