//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Сущности предметной области
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusAccountNotification.cs
*		Класс для определения уведомления пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.ComponentModel.DataAnnotations.Schema;
using Microsoft.EntityFrameworkCore;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtonotification AccountEntities
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Класс для определения сообщения пользователя
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public class CNotification : EntityDb<Guid>
        {
            #region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
            /// <summary>
            /// Имя таблицы
            /// </summary>
            public const String TABLE_NAME = "Notification";
			#endregion

			#region ======================================= МЕТОДЫ ОПРЕДЕЛЕНИЯ МОДЕЛЕЙ ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конфигурирование модели для типа <see cref="CNotification"/>
			/// </summary>
			/// <param name="modelBuilder">Интерфейс для построения моделей</param>
			//---------------------------------------------------------------------------------------------------------
			public static void ModelCreating(ModelBuilder modelBuilder)
            {
                // Определение для таблицы
                var model = modelBuilder.Entity<CNotification>();
                model.ToTable(TABLE_NAME, XDbConstants.SchemeName);
            }
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Тема уведомления
			/// </summary>
			public String? Topic { get; set; }

			/// <summary>
			/// Источник уведомления
			/// </summary>
			public String? Sender { get; set; }

			/// <summary>
			/// Важность уведомления
			/// </summary>
			public Int32? Importance { get; set; }

			/// <summary>
			/// Содержание уведомления
			/// </summary>
			public String Content { get; set; } = null!;

			/// <summary>
			/// Время создания уведомления
			/// </summary>
			public DateTime Created { get; set; }

			/// <summary>
			/// Статус прочитания уведомления
			/// </summary>
			public Boolean IsRead { get; set; }

			/// <summary>
			/// Статус нахождения уведомления в архиве
			/// </summary>
			public Boolean IsArchive { get; set; }
			#endregion
		}
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================