//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с ролями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRoleInterface.cs
*		Определение интерфейса сервиса для работы с ролями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
using Lotus.Repository;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /**
         * \defgroup AccountRole Подсистема работы с ролями
         * \ingroup Account
         * \brief Подсистема работы с ролями.
         * @{
         */
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Интерфейс сервиса для работы с ролями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public interface ILotusRoleService
        {
            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Создание роли по указанным данным
            /// </summary>
            /// <param name="roleCreate">Параметры для создания роли</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Роль</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response<CRoleDto>> CreateAsync(CRoleCreateDto roleCreate, CancellationToken token);

            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Обновление данных указанной роли
            /// </summary>
            /// <param name="roleUpdate">Параметры обновляемой роли</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Роль</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response<CRoleDto>> UpdateAsync(CRoleDto roleUpdate, CancellationToken token);

            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Получение списка ролей
            /// </summary>
            /// <param name="roleRequest">Параметры получения списка</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Cписок ролей</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<ResponsePage<CRoleDto>> GetAllAsync(CRolesDto roleRequest, CancellationToken token);

            //---------------------------------------------------------------------------------------------------------
            /// <summary>
            /// Удаление роли
            /// </summary>
            /// <param name="id">Идентификатор роли</param>
            /// <param name="token">Токен отмены</param>
            /// <returns>Статус успешности</returns>
            //---------------------------------------------------------------------------------------------------------
            Task<Response> DeleteAsync(Int32 id, CancellationToken token);
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================