//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с ролями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRoleConstants.cs
*		Работа с константными и первоначальными данными подсистемы работы с ролями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountRole
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения констант и первоначальных данных подсистемы работы с ролями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XRoleConstants
        {
            /// <summary>
            /// Роль администратора
            /// </summary>
            public static readonly CRole Admin = new CRole()
            {
                Id = 1,
                DispalyName = "Администратор",
                SystemName = "admin",
            };

            /// <summary>
            /// Роль редактора/модератора
            /// </summary>
            public static readonly CRole Editor = new CRole()
            {
                Id = 2,
                DispalyName = "Редактор",
                SystemName = "editor",
            };

            /// <summary>
            /// Роль пользователя
            /// </summary>
            public static readonly CRole User = new CRole()
            {
                Id = 3,
                DispalyName = "Пользователь",
                SystemName = "user",
            };
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================