//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с ролями
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserRoleConstants.cs
*		Работа с константными и первоначальными данными подсистемы работы с ролями.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountRole
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения констант и первоначальных данных подсистемы работы с ролями
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XUserRoleConstants
        {
            /// <summary>
            /// Роль администратора
            /// </summary>
            public static readonly UserRole Admin = new UserRole()
            {
                Id = 1,
				Name = "admin",
                DisplayName = "Администратор",
            };

            /// <summary>
            /// Роль редактора/модератора
            /// </summary>
            public static readonly UserRole Editor = new UserRole()
            {
                Id = 2,
				Name = "editor",
                DisplayName = "Редактор",
            };

            /// <summary>
            /// Роль пользователя
            /// </summary>
            public static readonly UserRole User = new UserRole()
            {
                Id = 3,
				Name = "user",
                DisplayName = "Пользователь",
            };
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================