//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с пользователем
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserConstants.cs
*		 Работа с константными и первоначальными данными подсистемы работы с пользователем.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountUser
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения констант и первоначальных данных подсистемы работы с пользователем.
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XUserConstants
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Администратор системы
            /// </summary>
            public static readonly CUser Admin = new CUser
            {
                Id = Guid.Parse("e3182c8f-87bc-4e27-a27f-b32e3e2b8018"),
                Login = "DanielDem",
                PasswordHash = XHashHelper.GetHash("!198418dsfA!"),
                Email = "dementevds@gmail.com",
                Name = "Даниил",
                Surname = "Дементьев",
                Patronymic = "Сергеевич",
                RoleId = XRoleConstants.Admin.Id
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================