//=====================================================================================================================
// Проект: Модуль учетной записи пользователя
// Раздел: Подсистема работы с группами
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUserGroupErrors.cs
*		Работа с ошибками подсистемы работы с группами.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
    namespace Account
    {
        //-------------------------------------------------------------------------------------------------------------
        /** \addtogroup AccountGroup
		*@{*/
        //-------------------------------------------------------------------------------------------------------------
        /// <summary>
        /// Статический класс для определения ошибок подсистемы работы с группами
        /// </summary>
        //-------------------------------------------------------------------------------------------------------------
        public static class XUserGroupErrors
        {
            #region ======================================= ДАННЫЕ ====================================================
            /// <summary>
            /// Группа не найдена
            /// </summary>
            public static readonly Result NotFound = new()
            {
                Code = 2000,
                Message = "Группа не найдено",
                Succeeded = false,
            };

            /// <summary>
            /// Нельзя удалить константное группу
            /// </summary>
            public static readonly Result NotDeleteConst = new()
            {
                Code = 2001,
                Message = "Нельзя удалить константное группу",
                Succeeded = false,
            };
            #endregion
        }
        //-------------------------------------------------------------------------------------------------------------
        /**@}*/
        //-------------------------------------------------------------------------------------------------------------
    }
}
//=====================================================================================================================